Davidn00/digital_thermometer/Microchip Packs/edc/PIC18LF2520.PIC
        <edc:AdjustPoint edc:offset="1" edc:_addr="0xF83"/>
        <edc:SFRDef edc:access="----r---" edc:cname="PORTE" edc:desc="" edc:impl="0x8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----x---" edc:name="PORTE" edc:nzwidth="0x8" edc:por="----x---" edc:_addr="0xF84">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="RE3" edc:desc="" edc:mask="0x1" edc:name="RE3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="MCLR" edc:desc="" edc:mask="0x1" edc:name="MCLR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="nMCLR" edc:desc="" edc:mask="0x1" edc:name="nMCLR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="VPP" edc:desc="" edc:mask="0x1" edc:name="VPP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="CCP9E" edc:desc="" edc:mask="0x1" edc:name="CCP9E" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.1">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="PC3E" edc:desc="" edc:mask="0x1" edc:name="PC3E" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="4" edc:_addr="0xF85"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LATA" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LATA" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF89">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LATA0" edc:desc="" edc:mask="0x1" edc:name="LATA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATA1" edc:desc="" edc:mask="0x1" edc:name="LATA1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATA2" edc:desc="" edc:mask="0x1" edc:name="LATA2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATA3" edc:desc="" edc:mask="0x1" edc:name="LATA3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATA4" edc:desc="" edc:mask="0x1" edc:name="LATA4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATA5" edc:desc="" edc:mask="0x1" edc:name="LATA5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATA6" edc:desc="" edc:mask="0x1" edc:name="LATA6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATA7" edc:desc="" edc:mask="0x1" edc:name="LATA7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="LA0" edc:desc="" edc:mask="0x1" edc:name="LA0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LA1" edc:desc="" edc:mask="0x1" edc:name="LA1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LA2" edc:desc="" edc:mask="0x1" edc:name="LA2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LA3" edc:desc="" edc:mask="0x1" edc:name="LA3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LA4" edc:desc="" edc:mask="0x1" edc:name="LA4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LA5" edc:desc="" edc:mask="0x1" edc:name="LA5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LA6" edc:desc="" edc:mask="0x1" edc:name="LA6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LA7" edc:desc="" edc:mask="0x1" edc:name="LA7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LATB" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LATB" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF8A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LATB0" edc:desc="" edc:mask="0x1" edc:name="LATB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB1" edc:desc="" edc:mask="0x1" edc:name="LATB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB2" edc:desc="" edc:mask="0x1" edc:name="LATB2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB3" edc:desc="" edc:mask="0x1" edc:name="LATB3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB4" edc:desc="" edc:mask="0x1" edc:name="LATB4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB5" edc:desc="" edc:mask="0x1" edc:name="LATB5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB6" edc:desc="" edc:mask="0x1" edc:name="LATB6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB7" edc:desc="" edc:mask="0x1" edc:name="LATB7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="LB0" edc:desc="" edc:mask="0x1" edc:name="LB0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LB1" edc:desc="" edc:mask="0x1" edc:name="LB1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LB2" edc:desc="" edc:mask="0x1" edc:name="LB2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LB3" edc:desc="" edc:mask="0x1" edc:name="LB3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LB4" edc:desc="" edc:mask="0x1" edc:name="LB4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LB5" edc:desc="" edc:mask="0x1" edc:name="LB5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LB6" edc:desc="" edc:mask="0x1" edc:name="LB6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LB7" edc:desc="" edc:mask="0x1" edc:name="LB7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
